#ifndef gdbms01_h
#define gdbms01_h

#include <windows.h>
#include <stdlib.h>
#include <malloc.h>
#include <memory.h>
#include <tchar.h>
#include <stdio.h>

#include "acheron/kernel/Precompiled.h"
#ifdef ACHERON_COMPILER_MSVC
#define BASEEXPORTFUNC _stdcall
#else
#define BASEEXPORTFUNC
#endif
typedef int TREE;
typedef short int BASE_INT;
typedef int BASE_INT64;

//== Список функций библиотеки GDBMS01.DLL
//   Помеченные символом * можно использовать в Visual C
typedef struct
{
 unsigned BaseOpen : 1;                                 // 001*
 unsigned BaseReadObject : 1;                           // 002*
 unsigned BaseOpen32 : 1;                               // 003
 unsigned BaseObjectConvertCoord : 1;                   // 004*
 unsigned BDelObjectInfo : 1;                           // 005
 unsigned BaseDeleteServiceObjects : 1;                 // 006*
 unsigned BaseObjectTextToIF : 1;                       // 007
 unsigned BaseObjectTextToIFOpen : 1;                   // 008
 unsigned BaseObjectTextToIFClose : 1;                  // 009
 unsigned BaseObjectTextToIFCont : 1;                   // 010
 unsigned BaseSetForTextToIF : 1;                       // 011
 unsigned BaseInitQuery : 1;                            // 012*
 unsigned BaseInitObject : 1;                           // 013*
 unsigned BaseClose : 1;                                // 014*
 unsigned BaseCloseObject : 1;                          // 015*
 unsigned BaseOpenTextError : 1;                        // 016*
 unsigned BaseSetFormat : 1;                            // 017*
 unsigned BaseGetFormat : 1;                            // 018*
 unsigned BaseSetMetDescriptor : 1;                     // 019*
 unsigned BasePackMode : 1;                             // 020*
 unsigned BaseReadObjectDown : 1;                       // 021
 unsigned BaseSizeObject : 1;                           // 022
 unsigned BaseTreeNavObject : 1;                        // 023
 unsigned BaseTreeNavCode : 1;                          // 024
 unsigned BaseReadNumbers : 1;                          // 025*
 unsigned BaseSetupQuery : 1;                           // 026*
 unsigned BaseReadConnectObjects : 1;                   // 027*
 unsigned BaseReadNameClass : 1;                        // 028*
 unsigned BaseReadName : 1;                             // 029*
 unsigned BaseReadModel : 1;                            // 030
 unsigned BaseReadListkv : 1;                           // 031*
 unsigned BaseReadListkv1 : 1;                          // 032
 unsigned BaseReadPassword : 1;                         // 033*
 unsigned BaseObjectStat : 1;                           // 034
 unsigned BaseReadObjectList : 1;                       // 035*
 unsigned BaseReadCodeList : 1;                         // 036
 unsigned BaseReadObjectKV : 1;                         // 037*
 unsigned BaseReadObjectLKV : 1;                        // 038*
 unsigned BaseGetSemMinMaxValue : 1;                    // 039
 unsigned BaseReadObjectListSem : 1;                    // 040
 unsigned BaseReadClassInfo : 1;                        // 041*
 unsigned BaseGetVersion : 1;                           // 042
 unsigned BaseCheckLists : 1;                           // 043
 unsigned BaseGetFreeNum : 1;                           // 044*
 unsigned BaseObjectCount : 1;                          // 045*
 unsigned BaseInitMultiQuery : 1;                       // 046*
 unsigned BaseMultiReadObjectOpen : 1;                  // 047*
 unsigned BaseMultiReadObjectCont : 1;                  // 048*
 unsigned BaseMultiReadObjectRetry : 1;                 // 049*
 unsigned BaseMultiReadObjectRestore : 1;               // 050*
 unsigned BaseMultiReadObjectListOpen : 1;              // 051*
 unsigned BaseMultiReadObjectListCont : 1;              // 052*
 unsigned BaseMultiReadObjectListRetry : 1;             // 053*
 unsigned BaseMultiReadObjectClose : 1;                 // 054*
 unsigned BaseCheckObject : 1;                          // 055
 unsigned BaseWriteObject : 1;                          // 056*
 unsigned BaseDeleteObject : 1;                         // 057*
 unsigned BaseWriteNameClass : 1;                       // 058*
 unsigned BaseWriteName : 1;                            // 059*
 unsigned BaseSetFindPrecision : 1;                     // 060
 unsigned BaseGetFindPrecision : 1;                     // 061
 unsigned BaseGetErrorMessage : 1;                      // 062
 unsigned BaseWriteModel : 1;                           // 063
 unsigned BaseWriteListkv : 1;                          // 064*
 unsigned BaseWriteListkv1 : 1;                         // 065
 unsigned BaseCheckPoint : 1;                           // 066*
 unsigned BaseCreateListMKO : 1;                        // 067
 unsigned BaseCreateListSem : 1;                        // 068
 unsigned BaseDeleteList : 1;                           // 069
 unsigned BaseDeleteListItem : 1;                       // 070
 unsigned BaseDeleteListCodeNum : 1;                    // 071
 unsigned BaseWriteListItem : 1;                        // 072
 unsigned BaseWriteListItemOpt : 1;                     // 073
 unsigned BaseDeleteLKV : 1;                            // 074
 unsigned BaseMultiMediaItemAdd : 1;                    // 075
 unsigned BaseMultiMediaItemDel : 1;                    // 076
 unsigned BaseMultiMediaItemNo : 1;                     // 077
 unsigned BaseGetMultiMediaItem : 1;                    // 078
 unsigned BaseMultiMediaItemDsc : 1;                    // 079
 unsigned BaseReadSvPr : 1;                             // 080*
 unsigned BaseGetAdrSvPrForNumber : 1;                  // 081*
 unsigned BaseDeleteObjectSvPr : 1;                     // 082
 unsigned BaseDeleteSvPr : 1;                           // 083*
 unsigned BaseAddSvPr : 1;                              // 084*
 unsigned BaseAddPrToPoint : 1;                         // 085*
 unsigned BaseDeletePrNumber : 1;                       // 086*
 unsigned BaseGetAdrSemSP : 1;                          // 087*
 unsigned BaseCoordConvert : 1;                         // 088
 unsigned BaseCodeStr : 1;                              // 089*
 unsigned BaseTransMKO : 1;                             // 090*
 unsigned BaseNumbersCharToInt : 1;                     // 091*
 unsigned BaseNumbersCharToLong : 1;                    // 092
 unsigned BaseNumbersCharToLongZ : 1;                   // 093
 unsigned BaseDateEncode : 1;                           // 094*
 unsigned BaseDateDecode : 1;                           // 095*
 unsigned BaseObjectSquare : 1;                         // 096
 unsigned BaseObjectSquare4 : 1;                        // 097
 unsigned BaseObjectSquareAll : 1;                      // 098*
 unsigned BasePrintObjectFile : 1;                      // 099
 unsigned BasePrintObjectToFile : 1;                    // 100
 unsigned BasePointInout : 1;                           // 101
 unsigned BaseCopyObject : 1;                           // 102*
 unsigned BaseCompCode : 1;                             // 103*
 unsigned BaseGetError : 1;                             // 104
 unsigned BaseConvFloatLong : 1;                        // 105
 unsigned BaseCoordIntToLong : 1;                       // 106
 unsigned BaseSelectObject : 1;                         // 107
 unsigned BaseMultiSelectObject : 1;                    // 108
 unsigned BaseMultiSelectCodeNumber : 1;                // 109
 unsigned BaseMultiSelectOneSP : 1;                     // 110
 unsigned BaseFormKV : 1;                               // 111
 unsigned BaseGetMemory : 1;                            // 112
 unsigned BaseFreeMemory : 1;                           // 113
 unsigned BaseReadSem : 1;                              // 114
 unsigned BaseReadSemFromNumber : 1;                    // 115
 unsigned BaseAddOneSem : 1;                            // 116
 unsigned BaseWriteOneSem : 1;                          // 117
 unsigned BaseDeleteOneSem : 1;                         // 118
 unsigned BaseFormSem : 1;                              // 119
 unsigned BaseReadSemComp : 1;                          // 120
 unsigned BaseSemCount : 1;                             // 121*
 unsigned BaseFeatureSplit : 1;                         // 122
 unsigned BaseSemLength : 1;                            // 123
 unsigned BaseSemValueUpdate : 1;                       // 124
 unsigned BaseReadSTRX11 : 1;                           // 125
 unsigned BaseGetX11SingleFieldCode : 1;                // 126
 unsigned BaseGetX11SingleFieldNumb : 1;                // 127
 unsigned BasePrintSemValue : 1;                        // 128
 unsigned BasePrintSemValue5 : 1;                       // 129
 unsigned BaseReadSemValue : 1;                         // 130
 unsigned BaseReadFeature : 1;                          // 131*
 unsigned BaseReadFeatureComp : 1;                      // 132*
 unsigned BaseDeleteFeature : 1;                        // 133*
 unsigned BaseDeleteFeatureComp : 1;                    // 134*
 unsigned BaseAddFeature : 1;                           // 135*
 unsigned BaseAddFeatureComp : 1;                       // 136*
 unsigned BaseUpdateFeature : 1;                        // 137*
 unsigned BaseUpdateFeatureComp : 1;                    // 138*
 unsigned BaseWriteImageFile : 1;                       // 139
 unsigned BaseWriteImageMemory : 1;                     // 140
 unsigned BaseDeleteImage : 1;                          // 141
 unsigned BaseObjectDeleteImage : 1;                    // 142
 unsigned BaseReadImageFile : 1;                        // 143
 unsigned DDCReadImageFile : 1;                         // 144
 unsigned BaseReadImageMemory : 1;                      // 145
 unsigned BaseObjectReadImageFile : 1;                  // 146
 unsigned BaseObjectReadImageMemory : 1;                // 147
 unsigned BaseSetAdrSem : 1;                            // 148
 unsigned BaseSetAdrSv : 1;                             // 149
 unsigned BaseSetAdrPr : 1;                             // 150
 unsigned BaseSetAdrSquare : 1;                         // 151
 unsigned BaseSetAdrMet : 1;                            // 152
 unsigned BaseSetAdrVideo : 1;                          // 153
 unsigned BaseSetAdrText : 1;                           // 154
 unsigned BaseFindObjectByCoordInt : 1;                 // 155
 unsigned BaseFindObjectByCoordFloat : 1;               // 156
 unsigned BaseFindDOByCoordInt : 1;                     // 157
 unsigned BaseFindAllDOByCoordInt : 1;                  // 158
 unsigned BaseFindAllDOByCoordFloat : 1;                // 159
 unsigned BaseFindDOByCoordFloat : 1;                   // 160
 unsigned BaseFindObjectStreamInt : 1;                  // 161
 unsigned BaseFindObjectStreamFloat : 1;                // 162
 unsigned BaseFindAnyObjectCoord : 1;                   // 163
 unsigned BaseFindAnyObjectCoordIF : 1;                 // 164*
 unsigned BaseMultiFindAnyObjectCoord : 1;              // 165
 unsigned BaseMultiFindAnyObjectCoordIF : 1;            // 166*
 unsigned BaseScaleAnalyze : 1;                         // 167
 unsigned BaseGetLabel : 1;                             // 168
 unsigned BaseSetFindMaxDistance : 1;                   // 169*
 unsigned BaseGetFindMaxDistance : 1;                   // 170*
 unsigned DDCOpen : 1;                                  // 171
 unsigned DDCClose : 1;                                 // 172
 unsigned DDCReadNameClass : 1;                         // 173
 unsigned DDCReadName : 1;                              // 174
 unsigned DDCReadObject : 1;                            // 175
 unsigned DDCInitQuery : 1;                             // 176
 unsigned DDCReadHeader : 1;                            // 177
 unsigned DDCFindObjectByCoordInt : 1;                  // 178
 unsigned DDCFindObjectByCoordFloat : 1;                // 179
 unsigned DDCFindAllDOByCoordInt : 1;                   // 180
 unsigned DDCFindAllDOByCoordFloat : 1;                 // 181
 unsigned BaseReadGlobal : 1;                           // 182
 unsigned BaseReadGlobalByPart : 1;                     // 183
 unsigned BaseReadClassInfoObject : 1;                  // 184*
 unsigned BaseMemoryMove : 1;                           // 185
 unsigned BasePackCode : 1;                             // 186
 unsigned BaseSetFlagCheckPr : 1;                       // 187
 unsigned TreeSK : 1;                                   // 188
 unsigned TreeS : 1;                                    // 189
 unsigned TreeCPY : 1;                                  // 190
 unsigned TreeSKD : 1;                                  // 191
 unsigned TreeSD : 1;                                   // 192
 unsigned a2daPrm : 1;                                  // 193
 unsigned BaseCalcSize : 1;                             // 194
 unsigned BaseCheckClassCode : 1;                       // 195
 unsigned BaseCopy : 1;                                 // 196
 unsigned BaseSetFeatureFilterRead : 1;                 // 197
 unsigned BaseSetFeatureFilterNoRead : 1;               // 198
 unsigned BaseGetFeatureFilterReadCount : 1;            // 199
 unsigned BaseGetFeatureFilterNoReadCount : 1;          // 200
 unsigned BaseGetFeatureFilterRead : 1;                 // 201
 unsigned BaseGetFeatureFilterNoRead : 1;               // 202
 unsigned BaseSetFeatureFilterService : 1;              // 203
 unsigned BaseGetFeatureFilterService : 1;              // 204
 unsigned BaseGetFeatureFilterServiceCount : 1;         // 205
 unsigned BaseSwapSvPr : 1;                             // 206
 unsigned BaseSortPr : 1;                               // 207
 unsigned BaseCreateListWindows : 1;                    // 208
 unsigned BaseSetMaxCodePositions : 1;                  // 209
 unsigned BaseGetMaxCodePositions : 1;                  // 210
 unsigned BaseChangeCodeObject : 1;                     // 211
 unsigned BaseChangeCodeInList : 1;                     // 212
 unsigned BaseAddMetric :1;                             // 213*
 unsigned BaseDelMetric :1;                             // 214*
 unsigned BaseUpdateMetric :1;                          // 215*
 unsigned BaseGetFreeNumbers :1;                        // 216*
 unsigned BaseFeatureDelFull :1;                        // 217
 unsigned BaseExtractDO :1;                             // 218
 unsigned BaseCorrRelations :1;                         // 219
 unsigned BaseCreateListWinForRegion :1;                // 220
 unsigned BaseGetSelectInfo :1;                         // 221
 unsigned BaseObjectLengthAll :1;                       // 222
 unsigned BasePointInoutEps : 1;                        // 223
 unsigned BaseCheckObjectFull : 1;                      // 224
 unsigned TreeOpen : 1;                                 // 225
 unsigned TreeClose : 1;                                // 226
 unsigned BaseReadObjectSV : 1;                         // 227
 unsigned BaseDeleteObjectSV : 1;                       // 228
 unsigned BaseWriteApplicationInfo : 1;                 // 229
 unsigned BaseWriteUserInfo : 1;                        // 230
 unsigned BaseSetCodeSemPoint : 1;                      // 231
 unsigned BaseGetCodeSemPoint : 1;                      // 232
 unsigned BaseGetNumberQuery : 1;                       // 233
 unsigned BaseCopyObjectEasy : 1;                       // 234
 unsigned BaseWriteObjectSV : 1;                        // 235
 unsigned BaseDeleteObjects : 1;                        // 236
 unsigned BaseCalcSizeDouble : 1;                       // 237
 unsigned BaseNumbersCharToDouble : 1;                  // 238
 unsigned BaseAddFeatureCompUniversal : 1;              // 239
 unsigned BaseCreateListWindowsByCoords : 1;            // 240
 unsigned BaseSetCoeffCoordGeo : 1;                     // 241
} GBASE_FUN01;


//--------------- Для работы с элементами мультимедиа -----------------
#define MULTI_BASE          1  // Элемент мультимедиа хранится в объекте базы
#define MULTI_FILE          0  // Элемент мультимедиа хранится в файле
#define MULTI_NO            0  // Не обрабатывать элемент мультимедиа
#define MULTI_DEL           1  // Удалить элемент
#define MULTI_ADD           2  // Добавить элемент
#define MULTI_DSC           3  // Изменить описание элемента

//--------------- Коды ошибок ----------------------------------------
#define BERR_OK             0  // Нормальное завершение
#define BERR_MEM            1  // Нет оперативной памяти
#define BERR_NOINF          2  // Нет информации по запросу
#define BERR_QUERY          3  // Ошибка в запросе
#define BERR_PARAM          4  // Ошибка в параметрах
#define BERR_PASS           5  // Неверный пароль
#define BERR_READ           6  // База открыта только на чтение
